# group by
group by method to group rows of data together and call aggregate functions

In [1]:
import numpy as np
import pandas as pd
data= {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [3]:
dataframe= pd.DataFrame(data)

In [4]:
dataframe

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [25]:
dataframe.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [28]:
dataframe.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Merging joining and concatenating

dimensions should match along the axis you are concatenating on. pd.concat([list of data frames])
merge function is similar logic as merging SQL tables
pd.merge(left,right, how='inner', on='key') single kiy or a list of keys
JOining- combining the columns of two potentially differently indexed dataframes into a single result dataframe
same as merge except the keys you want to join on are on ur index instead of a column
left.join(right) #how available too

# operations

df['A'].unique(), nunique(), len(df['A'].unique())|
df['A'].value_counts()|
df.head()|
df['A'].apply(function_name) or lambda functions (lambda x : x*2) #to apply any custom fumctions|
df['A'].apply(len)|
df.drop('col1', axis=1, inplace= True)|
df.columns|
df.index|
df.sort_values(by='col1')|
df.isnull()|
df.pivot_table(values='col1',index=['col1','col2'],columns= ['col4'])|

# data input and output

for html and sql data:
sqlalchemy,
lxml,
html5lib,
beautifulsoup4
xlrd for excel

df.to_csv('name ur file whatev u want', index= False) || pandas can import data , cant import formula, images or macros
df= pandas.read_excel('Excel_Sample.xlsx', sheetname= 'Sheet1')||
df= pandas.to_excel('name of ur new file',sheet_name= 'whateve name u like')||
df= pandas.read_html('link to the html page') its not exactly related to a pandas data frame
its actually a list, pandas tried to find every table element in html file, table references/markings just like list classes||
so that list where each and evry item is a dataframe, this is essentially web scraping of pandas||
pandas isnt the best way for sequel coz they are many flavours of sql engine like postgres, mysql, etc

#we are going to temporarily build a sql engine thats temporarily held in memory 
search for a specific driver depending on ur sql engine( postgres) ie psycopg2 
#how pandas could read an entire table of sequel f it had to
from sqlalchemy import create_engine
engine= create_engine('sqlite:///:memory:')
df.to_sql('my_table', engine)
here engine is a connection object to the sequel engine
better to use psychopg2
sh= pd.read_sql('my_table', con= engine)